----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 512, 512]          10,400
       BatchNorm2d-2         [-1, 32, 512, 512]              64
            Conv2d-3         [-1, 64, 256, 256]          32,832
       BatchNorm2d-4         [-1, 64, 256, 256]             128
            Conv2d-5        [-1, 128, 128, 128]         131,200
       BatchNorm2d-6        [-1, 128, 128, 128]             256
            Conv2d-7        [-1, 128, 128, 128]         147,584
       BatchNorm2d-8        [-1, 128, 128, 128]             256
            Conv2d-9        [-1, 128, 128, 128]         147,584
      BatchNorm2d-10        [-1, 128, 128, 128]             256
    ResidualBlock-11        [-1, 128, 128, 128]               0
           Conv2d-12        [-1, 128, 128, 128]         147,584
      BatchNorm2d-13        [-1, 128, 128, 128]             256
           Conv2d-14        [-1, 128, 128, 128]         147,584
      BatchNorm2d-15        [-1, 128, 128, 128]             256
    ResidualBlock-16        [-1, 128, 128, 128]               0
           Conv2d-17        [-1, 128, 128, 128]         147,584
      BatchNorm2d-18        [-1, 128, 128, 128]             256
           Conv2d-19        [-1, 128, 128, 128]         147,584
      BatchNorm2d-20        [-1, 128, 128, 128]             256
    ResidualBlock-21        [-1, 128, 128, 128]               0
           Conv2d-22        [-1, 128, 128, 128]         147,584
      BatchNorm2d-23        [-1, 128, 128, 128]             256
           Conv2d-24        [-1, 128, 128, 128]         147,584
      BatchNorm2d-25        [-1, 128, 128, 128]             256
    ResidualBlock-26        [-1, 128, 128, 128]               0
           Conv2d-27        [-1, 128, 128, 128]         147,584
      BatchNorm2d-28        [-1, 128, 128, 128]             256
           Conv2d-29        [-1, 128, 128, 128]         147,584
      BatchNorm2d-30        [-1, 128, 128, 128]             256
    ResidualBlock-31        [-1, 128, 128, 128]               0
  ConvTranspose2d-32         [-1, 64, 257, 257]         131,136
      BatchNorm2d-33         [-1, 64, 257, 257]             128
  ConvTranspose2d-34         [-1, 32, 513, 513]          32,800
      BatchNorm2d-35         [-1, 32, 513, 513]              64
  ConvTranspose2d-36         [-1, 32, 513, 513]          82,976
           Conv2d-37          [-1, 1, 512, 512]             129
           Conv2d-38          [-1, 1, 512, 512]             129
           Conv2d-39          [-1, 1, 512, 512]             129
           Conv2d-40          [-1, 1, 512, 512]             129
================================================================
Total params: 1,900,900
Trainable params: 1,900,900
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 4.00
Forward/backward pass size (MB): 889.25
Params size (MB): 7.25
Estimated Total Size (MB): 900.50
----------------------------------------------------------------
